In [156]:
import pandas as pd
import numpy as np

### Series and DataFrames

In [157]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
type(s)

pandas.core.series.Series

In [158]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
type(df)

pandas.core.frame.DataFrame

In [159]:
type(df['A'])

pandas.core.series.Series

In [160]:
type(df[['A', 'B']])

pandas.core.frame.DataFrame

In [161]:
type(df['A'])

pandas.core.series.Series

In [162]:
type(df[['A']])

pandas.core.frame.DataFrame

In [163]:
df[['A']]

                   A
2013-01-01  0.775092
2013-01-02 -2.231795
2013-01-03 -2.337247
2013-01-04 -0.485655
2013-01-05  1.349052
2013-01-06  0.112055

In [164]:
df.A

2013-01-01    0.775092
2013-01-02   -2.231795
2013-01-03   -2.337247
2013-01-04   -0.485655
2013-01-05    1.349052
2013-01-06    0.112055
Freq: D, Name: A, dtype: float64

### Viewing Data

In [165]:
df.head()

                   A         B         C         D
2013-01-01  0.775092  1.168905 -0.834874  0.522130
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748
2013-01-05  1.349052 -1.124020  0.677485 -0.851894

In [166]:
df.tail()

                   A         B         C         D
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748
2013-01-05  1.349052 -1.124020  0.677485 -0.851894
2013-01-06  0.112055 -1.053417  0.707479 -0.978927

In [167]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.469750 -0.196496  0.050006 -0.253524
std    1.535498  0.937516  0.690493  0.727922
min   -2.337247 -1.124020 -0.834874 -0.978927
25%   -1.795260 -0.956179 -0.538737 -0.808707
50%   -0.186800 -0.409776  0.228210 -0.474947
75%    0.609333  0.448057  0.631100  0.323911
max    1.349052  1.168905  0.707479  0.737441

In [168]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [169]:
df.sort_index()

                   A         B         C         D
2013-01-01  0.775092  1.168905 -0.834874  0.522130
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748
2013-01-05  1.349052 -1.124020  0.677485 -0.851894
2013-01-06  0.112055 -1.053417  0.707479 -0.978927

In [170]:
df.sort_values(by='B', inplace=True)

In [171]:
df.sort_index(inplace=True)

In [172]:
df

                   A         B         C         D
2013-01-01  0.775092  1.168905 -0.834874  0.522130
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748
2013-01-05  1.349052 -1.124020  0.677485 -0.851894
2013-01-06  0.112055 -1.053417  0.707479 -0.978927

### Selecting

In [173]:
df[0:4]

                   A         B         C         D
2013-01-01  0.775092  1.168905 -0.834874  0.522130
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748

In [174]:
type(df.loc[['2013-01-01','2013-01-02']])

pandas.core.frame.DataFrame

In [175]:
type(df.loc['2013-01-02', 'A'])

numpy.float64

In [176]:
df.loc[['2013-01-01','2013-01-02'], ["A", "B"]]

                   A         B
2013-01-01  0.775092  1.168905
2013-01-02 -2.231795 -0.155086

In [177]:
type(df[0:3])

pandas.core.frame.DataFrame

In [178]:
# Komische Sachen gehen auch
# Das heisst wir können hier Range von Daten geben
df.sort_index(inplace=True)
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748

Selecting mit labels

In [179]:
df.loc[dates[0]]

A    0.775092
B    1.168905
C   -0.834874
D    0.522130
Name: 2013-01-01 00:00:00, dtype: float64

In [180]:
# Vorsicht beim Type der Rueckgabe
type(df.loc[dates[0]])
df.loc[dates[0]].index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [181]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.775092  1.168905
2013-01-02 -2.231795 -0.155086
2013-01-03 -2.337247 -0.664466
2013-01-04 -0.485655  0.649105
2013-01-05  1.349052 -1.124020
2013-01-06  0.112055 -1.053417

In [182]:
# Hier ist die Rueckgabe ein DataFrame
type(df.loc[:, ["A", "B"]])

pandas.core.frame.DataFrame

In [183]:
df.loc[dates[0], "A"]

0.7750917542862815

In [184]:
# Hier ist die Rueckgabe eine Zahl
type(df.loc[dates[0], "A"])

numpy.float64

In [185]:
df.at[dates[0], "A"]

0.7750917542862815

Selecting mit Indizes

<span style="color:red">Z</span>uerst die <span style="color:red">Z</span>eilen, <span style="color:red">sp</span>aeter <span style="color:red">Sp</span>alten

In [186]:
df.iloc[3]

A   -0.485655
B    0.649105
C   -0.035526
D   -0.270748
Name: 2013-01-04 00:00:00, dtype: float64

In [187]:
type(df.iloc[3])

pandas.core.series.Series

In [188]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.485655  0.649105
2013-01-05  1.349052 -1.124020

In [189]:
type(df.iloc[3:5, 0:2])

pandas.core.frame.DataFrame

In [190]:
df.iloc[:, 2]

2013-01-01   -0.834874
2013-01-02    0.491947
2013-01-03   -0.706474
2013-01-04   -0.035526
2013-01-05    0.677485
2013-01-06    0.707479
Name: C, dtype: float64

In [191]:
type(df.iloc[:, 2])

pandas.core.series.Series

In [192]:
df.iloc[1, 1]

-0.15508597406476807

In [193]:
type(df.iloc[1, 1])

numpy.float64

In [194]:
df.iat[1, 1]

-0.15508597406476807

### Boolean Masks

In [195]:
df.A > 0

2013-01-01     True
2013-01-02    False
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06     True
Name: A, dtype: bool

In [196]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.775092  1.168905 -0.834874  0.522130
2013-01-05  1.349052 -1.124020  0.677485 -0.851894
2013-01-06  0.112055 -1.053417  0.707479 -0.978927

In [197]:
df > 0

                A      B      C      D
2013-01-01   True   True  False   True
2013-01-02  False  False   True  False
2013-01-03  False  False  False   True
2013-01-04  False   True  False  False
2013-01-05   True  False   True  False
2013-01-06   True  False   True  False

In [198]:
# Vorsicht, so produziert man viele NaNs
# Alles wo die Werte nicht positiv sind wird durch NaN ersetzt
df[df > 0]

                   A         B         C         D
2013-01-01  0.775092  1.168905       NaN  0.522130
2013-01-02       NaN       NaN  0.491947       NaN
2013-01-03       NaN       NaN       NaN  0.737441
2013-01-04       NaN  0.649105       NaN       NaN
2013-01-05  1.349052       NaN  0.677485       NaN
2013-01-06  0.112055       NaN  0.707479       NaN

In [199]:
# Fuer kategorische Variablen: isin
df["E"] = list("abcdef")

In [200]:
df

                   A         B         C         D  E
2013-01-01  0.775092  1.168905 -0.834874  0.522130  a
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441  c
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748  d
2013-01-05  1.349052 -1.124020  0.677485 -0.851894  e
2013-01-06  0.112055 -1.053417  0.707479 -0.978927  f

In [201]:
df.E.isin(list("bcd"))

2013-01-01    False
2013-01-02     True
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06    False
Name: E, dtype: bool

In [202]:
df["F"] = [1, 2, 3, 4, 5, 6]

In [203]:
df[df.F.isin([1, 2, 3])]

                   A         B         C         D  E  F
2013-01-01  0.775092  1.168905 -0.834874  0.522130  a  1
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b  2
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441  c  3

In [204]:
df[df.E.isin(list("bcd"))]

                   A         B         C         D  E  F
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b  2
2013-01-03 -2.337247 -0.664466 -0.706474  0.737441  c  3
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748  d  4

### Neue Werte setzen

In [205]:
df.loc["2013-01-03","A"] = 3

In [206]:
df.iat[2, 0] = 5

In [207]:
df

                   A         B         C         D  E  F
2013-01-01  0.775092  1.168905 -0.834874  0.522130  a  1
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b  2
2013-01-03  5.000000 -0.664466 -0.706474  0.737441  c  3
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748  d  4
2013-01-05  1.349052 -1.124020  0.677485 -0.851894  e  5
2013-01-06  0.112055 -1.053417  0.707479 -0.978927  f  6

In [208]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [209]:
# Vorsicht, hier werden Werte abgeschnitten
df["F"] = s1

In [210]:
df

                   A         B         C         D  E    F
2013-01-01  0.775092  1.168905 -0.834874  0.522130  a  NaN
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b  1.0
2013-01-03  5.000000 -0.664466 -0.706474  0.737441  c  2.0
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748  d  3.0
2013-01-05  1.349052 -1.124020  0.677485 -0.851894  e  4.0
2013-01-06  0.112055 -1.053417  0.707479 -0.978927  f  5.0

### Fehlende Werte

In [141]:
df

                   A         B         C         D  E    F
2013-01-01 -1.431741 -0.613989  0.497981  0.990558  a  NaN
2013-01-02  1.353761  0.899531 -0.905976  0.134017  b  1.0
2013-01-03  5.000000  0.508604 -1.109908 -0.059429  c  2.0
2013-01-04 -1.278687 -0.792290 -0.021985 -0.059614  d  3.0
2013-01-05  0.752461  2.322357 -0.132983 -0.329785  e  4.0
2013-01-06  1.563171  0.274943  0.424541 -0.281931  f  5.0

In [211]:
df.dropna()

                   A         B         C         D  E    F
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b  1.0
2013-01-03  5.000000 -0.664466 -0.706474  0.737441  c  2.0
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748  d  3.0
2013-01-05  1.349052 -1.124020  0.677485 -0.851894  e  4.0
2013-01-06  0.112055 -1.053417  0.707479 -0.978927  f  5.0

In [212]:
df.fillna(1)

                   A         B         C         D  E    F
2013-01-01  0.775092  1.168905 -0.834874  0.522130  a  1.0
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145  b  1.0
2013-01-03  5.000000 -0.664466 -0.706474  0.737441  c  2.0
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748  d  3.0
2013-01-05  1.349052 -1.124020  0.677485 -0.851894  e  4.0
2013-01-06  0.112055 -1.053417  0.707479 -0.978927  f  5.0

In [213]:
df.isna()

                A      B      C      D      E      F
2013-01-01  False  False  False  False  False   True
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False
2013-01-05  False  False  False  False  False  False
2013-01-06  False  False  False  False  False  False

### Eigene Transformationen

In [214]:
df.drop(columns=["E", "F"], inplace=True)
df

                   A         B         C         D
2013-01-01  0.775092  1.168905 -0.834874  0.522130
2013-01-02 -2.231795 -0.155086  0.491947 -0.679145
2013-01-03  5.000000 -0.664466 -0.706474  0.737441
2013-01-04 -0.485655  0.649105 -0.035526 -0.270748
2013-01-05  1.349052 -1.124020  0.677485 -0.851894
2013-01-06  0.112055 -1.053417  0.707479 -0.978927

In [215]:
# Hier muss eine Vektoroperation rein
f = lambda x: np.sum(x)

In [216]:
# Geht in beide Richtungen
# Zeilenweise axis=0
df.agg(f, axis=0)

A    4.518749
B   -1.178979
C    0.300036
D   -1.521143
dtype: float64

In [152]:
# Spaltenweise axis=1
df.agg(f, axis=1)

2013-01-01   -0.557190
2013-01-02    1.481333
2013-01-03    4.339267
2013-01-04   -2.152576
2013-01-05    2.612050
2013-01-06    1.980724
dtype: float64

In [217]:
df.A

2013-01-01    0.775092
2013-01-02   -2.231795
2013-01-03    5.000000
2013-01-04   -0.485655
2013-01-05    1.349052
2013-01-06    0.112055
Name: A, dtype: float64

In [219]:
# Hier kommt eine Zahl rein
f = lambda x: x * 5.6

In [220]:
# Hier wird jede Zahl in der Spalte A mit 5.6
df['A'].transform(f)

2013-01-01     4.340514
2013-01-02   -12.498054
2013-01-03    28.000000
2013-01-04    -2.719665
2013-01-05     7.554690
2013-01-06     0.627507
Name: A, dtype: float64

### Verkleben

In [224]:
# Untereinander kleben mit concat
df = pd.DataFrame(np.random.randn(10, 4))
pieces = [df[:3], df[3:7], df[7:]]

In [228]:
df[0:3]

          0         1         2         3
0  0.461496  0.010850  0.568109  0.100530
1 -0.441802  0.473012  0.664970  0.900993
2 -0.238037 -0.148736 -0.008432 -0.139277

In [226]:
pd.concat(pieces)

          0         1         2         3
0  0.461496  0.010850  0.568109  0.100530
1 -0.441802  0.473012  0.664970  0.900993
2 -0.238037 -0.148736 -0.008432 -0.139277
3 -0.077322 -1.559141 -0.137974  1.442116
4 -1.166204 -1.865523 -2.937131  0.929687
5 -0.265371 -0.716472 -0.671075 -0.158551
6  1.010959  0.157401 -0.767499 -0.851974
7  2.045474  0.596722  0.153048 -0.913258
8 -1.383023  1.103931  0.261313 -0.805023
9 -0.807210  0.220625 -0.430225  0.194884

In [227]:
# Nebeneinander kann concat auch
pd.concat(pieces, axis=1)

,0,1,2,3,0,1,2,3,0,1,2,3
0,0.461496,0.010850,0.568109,0.100530,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,-0.441802,0.473012,0.664970,0.900993,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,-0.238037,-0.148736,-0.008432,-0.139277,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-0.077322,-1.559141,-0.137974,1.442116,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,-1.166204,-1.865523,-2.937131,0.929687,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,-0.265371,-0.716472,-0.671075,-0.158551,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,1.010959,0.157401,-0.767499,-0.851974,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.045474,0.596722,0.153048,-0.913258
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-1.383023,1.103931,0.261313,-0.805023
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.807210,0.220625,-0.430225,0.194884

In [229]:
# Geht auch nebeneinander ohne Index
[df.reset_index(drop=True, inplace=True) for df in pieces]
pd.concat(pieces, axis=1)

,0,1,2,3,0,1,2,3,0,1,2,3
0,0.461496,0.010850,0.568109,0.100530,-0.077322,-1.559141,-0.137974,1.442116,2.045474,0.596722,0.153048,-0.913258
1,-0.441802,0.473012,0.664970,0.900993,-1.166204,-1.865523,-2.937131,0.929687,-1.383023,1.103931,0.261313,-0.805023
2,-0.238037,-0.148736,-0.008432,-0.139277,-0.265371,-0.716472,-0.671075,-0.158551,-0.807210,0.220625,-0.430225,0.194884
3,NaN,NaN,NaN,NaN,1.010959,0.157401,-0.767499,-0.851974,NaN,NaN,NaN,NaN

In [71]:
# merge ist die pandas version von sql join
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [72]:
right

   key  rval
0  foo     4
1  foo     5

In [73]:
# Bei multiple keys erhalten wir das Kreuzprodukt
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [74]:
# left joins gehen auch
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar", "blu"], "rval": [4, 5, 6]})
pd.merge(left,
         right,
         how='left',
         on='key'
)

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [75]:
# right joins gehen auch
pd.merge(left,
    right,
    how='right',
    on='key'
)

   key  lval  rval
0  foo   1.0     4
1  bar   2.0     5
2  blu   NaN     6

In [76]:
# inner joins gehen auch
left = pd.DataFrame({"key": ["foo", "bar", "bla"], "lval": [1, 2, 3]})
right = pd.DataFrame({"key": ["foo", "bar", "blu"], "rval": [4, 5, 6]})
pd.merge(left,
    right,
    how='inner',
    on='key'
)

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Group by

In [230]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [231]:
df.groupby('A')

In [79]:
z = df.groupby('A')[['C', 'D']].sum()
z

            C         D
A
bar  0.369034 -2.732981
foo -0.396052  1.356526

In [80]:
z.index

Index(['bar', 'foo'], dtype='object', name='A')

In [81]:
z['C']

A
bar    0.369034
foo   -0.396052
Name: C, dtype: float64

In [82]:
z.loc['bar']

C    0.369034
D   -2.732981
Name: bar, dtype: float64

In [83]:
z = df.groupby(['A', 'B'])[['C', 'D']].sum()
z

                  C         D
A   B
bar one   -0.253871  0.038638
    three  1.074318 -1.897856
    two   -0.451413 -0.873763
foo one   -0.004635 -0.778751
    three -0.912437  1.106344
    two    0.521020  1.028934

In [84]:
z.index

MultiIndex([('bar',   'one'),
            ('bar', 'three'),
            ('bar',   'two'),
            ('foo',   'one'),
            ('foo', 'three'),
            ('foo',   'two')],
           names=['A', 'B'])

In [85]:
z.loc['bar'].loc['one']

C   -0.253871
D    0.038638
Name: one, dtype: float64

### Schmaler machen

In [88]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df

                     A         B
first second
bar   one     1.845014 -1.010557
      two     0.505782  1.391461
baz   one    -0.987723  1.019260
      two     0.484258  0.729443
foo   one    -0.317253  1.331691
      two    -1.505569 -0.825193
qux   one     0.962370 -0.575556
      two    -1.168902 -0.597778

In [87]:
stacked = df.stack()
stacked

first  second
bar    one     A   -0.771599
               B   -1.779425
       two     A    2.313920
               B   -2.192305
baz    one     A   -1.046210
               B   -1.135833
       two     A    0.591454
               B    0.837573
foo    one     A    1.587402
               B    0.932763
       two     A    0.175057
               B    0.457899
qux    one     A    0.378649
               B    0.067687
       two     A   -0.861989
               B   -0.594803
dtype: float64

In [89]:
type(stacked)

pandas.core.series.Series

In [75]:
z = pd.DataFrame(stacked)
z.columns = ['vals']
z

                    vals
first second
bar   one    A -1.401062
             B  0.149005
      two    A -0.750244
             B  0.018133
baz   one    A -0.999222
             B  0.371569
      two    A  0.474806
             B  1.115227
foo   one    A -0.984754
             B  0.378121
      two    A -1.092887
             B  1.089937
qux   one    A -0.261627
             B -0.116730
      two    A  0.797584
             B  1.557293

In [95]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
cols = pd.MultiIndex.from_tuples([('A', 'C'), ('A', 'D')])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=cols)
df

                     A
                     C         D
first second
bar   one    -1.183723  0.306840
      two     1.157775 -2.397780
baz   one    -0.366517  1.203330
      two     1.145878  0.813937
foo   one     0.102069  0.813902
      two    -0.781209 -1.102040
qux   one    -0.449561  0.895267
      two     1.403878  0.854852

In [96]:
stacked = df.stack()
stacked

                       A
first second
bar   one    C -1.183723
             D  0.306840
      two    C  1.157775
             D -2.397780
baz   one    C -0.366517
             D  1.203330
      two    C  1.145878
             D  0.813937
foo   one    C  0.102069
             D  0.813902
      two    C -0.781209
             D -1.102040
qux   one    C -0.449561
             D  0.895267
      two    C  1.403878
             D  0.854852

In [99]:
stacked.stack()

first  second
bar    one     C  A   -1.183723
               D  A    0.306840
       two     C  A    1.157775
               D  A   -2.397780
baz    one     C  A   -0.366517
               D  A    1.203330
       two     C  A    1.145878
               D  A    0.813937
foo    one     C  A    0.102069
               D  A    0.813902
       two     C  A   -0.781209
               D  A   -1.102040
qux    one     C  A   -0.449561
               D  A    0.895267
       two     C  A    1.403878
               D  A    0.854852
dtype: float64

In [93]:
type(stacked)

pandas.core.frame.DataFrame

In [94]:
stacked.unstack()

                     A
                     C         D
first second
bar   one    -0.720987  0.404809
      two    -0.749304 -0.747246
baz   one     2.379290  0.068265
      two    -0.649854 -1.477707
foo   one     1.793508 -1.329600
      two     0.527493 -0.310970
qux   one    -0.497667 -0.351811
      two    -0.493679 -0.083036

In [82]:
stacked.unstack(1)

                A
second        one       two
first
bar   C  0.687274  2.635738
      D  0.852420  1.414812
baz   C  0.879718 -0.706858
      D  0.348400  0.166932
foo   C -0.446378 -0.491160
      D  0.452216 -0.654348
qux   C  0.015336 -0.836063
      D -0.403691  0.522055

### Pivotisieren

In [90]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo  0.761077 -0.606681
1     one  B  foo -0.356042  0.474504
2     two  C  foo  1.046916 -0.483352
3   three  A  bar  1.408728 -0.406593
4     one  B  bar -1.205208 -0.098778
5     one  C  bar  0.943586  1.799701
6     two  A  foo  0.423332  0.126558
7   three  B  foo -2.854732  0.616204
8     one  C  foo  0.623106  1.787913
9     one  A  bar  0.709951 -0.663115
10    two  B  bar  0.026964  0.516002
11  three  C  bar  0.351451  0.354875

In [91]:
df.pivot(
    index=['A', 'B'],
    columns='C',
    values='D'
)

C             bar       foo
A     B
one   A  0.709951  0.761077
      B -1.205208 -0.356042
      C  0.943586  0.623106
three A  1.408728       NaN
      B       NaN -2.854732
      C  0.351451       NaN
two   A       NaN  0.423332
      B  0.026964       NaN
      C       NaN  1.046916

### Kategorische Variablen

In [92]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [93]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [95]:
df["grade"] = df["raw_grade"].astype("category")
df.grade

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [96]:
new_categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.rename_categories(new_categories)
df.grade

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

In [97]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)
df.grade

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']